BASE = 100


POS_INF = float('inf')


NEG_INF = float('-inf')


HABITS = set([
    '看展覽', '攝影', '寵物', '看劇', '籃球', '烹飪', '玩遊戲', '唱歌', '健身', '閱讀', '跳舞', '寫作',
    '露營', '跑步', '游泳', '園藝', '旅行', '彩票收藏', '養螞蟻', '硬幣收藏', '撞球', '撲克', '咖啡', '品酒',
    '保齡球', '桌球', '生存遊戲', '高爾夫球', '鐵人三項', '水族飼養', '冥想', '觀鳥', '排球', '網球', '西洋棋',
    '塗鴉', '浮潛', '滑雪', '跳傘', '購物', '養花', '釣魚', '水肺潛水', '改車', '跑山', '棒球', '羽毛球', '瑜伽'
])


INTRODUCE = (
    '不擅長開話題', '是個很好的傾聽者', '慢熱，熟了以後像瘋子', '慢慢聊你就認識我了', '不像雙子的雙子', '懶得打',
    '這裡不常開，追我ig', '尋找有趣的靈魂', '佛系聊天', '我很好聊，聊了就知道', '不聊怎麼了解我？', '我想找交往對象',
    '我不帥，但我很溫柔', '我很難搞', '我很胖，介意的別來', '我是一個愛狗人', 'zzz', '...', 'Hi', 'Hello',
)
